IDEA Open Model
RebarPoint3D Properties
Compatible with IDEA StatiCa 20.1
The RebarPoint3D type exposes the following members.
Properties
Name | Description
BendRadius
 Gets or sets the radius of the Arc
Id
 Element Id
 (Inherited from OpenElementId.)
Name
 Gets or sets the Name
 (Inherited from Point3D.)
X
 Gets or sets the X-coordinate value
 (Inherited from Point3D.)
Y
 Gets or sets the Y-coordinate value
 (Inherited from Point3D.)
Z
 Gets or sets the Z-coordinate value
 (Inherited from Point3D.)
Top
See Also
Reference
RebarPoint3D Class
IdeaRS.OpenModel.Model Namespace